linux-jm/manual/manual/util-linux/draft/man8/fsck.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.\"
.\" Japanese Version Copyright (c) 1999 NAKANO Takeo all rights reserved.
.\" Translated Mon Mar 18 2000 by NAKANO Takeo <nakano@apm.seikei.ac.jp>
.\" Updated & Modified Wed 14 Jun 2000 by NAKANO Takeo 
.\"
.\" This man page is a part of util-linux.
.\"
.\" " for hilit19
.TH FSCK 8 "2 July 1996" "Util-Linux 2.6" "Linux Programmer's Manual"
.\"O .SH NAME
.\"O fsck.minix \- a file system consistency checker for Linux
.SH 名前
fsck.minix \- Linux 用のファイルシステム整合性チェッカ
.\"O .SH SYNOPSIS
.SH 書式
.B "fsck.minix [ \-larvsmf ]"
.\"O device
.I device
.\"O .SH DESCRIPTION
.SH 説明
.\"O .B fsck.minix
.\"O performs a consistency check for the Linux MINIX filesystem.  The current
.\"O version supports the 14 character and 30 character filename options.
.B fsck.minix
は Linux MINIX ファイルシステムの整合性チェックを行う。
現在のバージョンは、ファイル名のオプションとして 14 文字と
30 文字とをサポートしている。

.\"O The program
.\"O assumes the file system is quiescent.
.\"O .B fsck.minix
.\"O should not be used on a mounted device unless you can be sure nobody is
.\"O writing to it (and remember that the kernel can write to it when it
.\"O searches for files).
このプログラムでは、
ファイルシステムがアクティブではないことを前提としている。
マウントされたデバイスに対しては、
誰も書き込みを行っていないという確信が持てなければ、
.B fsck.minix
を用いるべきではない
(そしてカーネルがファイル検索を行うときに、
書き込みを行うかもしれないことに注意)。

.\"O The device will usually have the following form:
.I device
は通常以下のようなものである:

.nf
.RS
/dev/hda[1-63] (IDE disk 1)
/dev/hdb[1-63] (IDE disk 2)
/dev/sda[1-15] (SCSI disk 1)
/dev/sdb[1-15] (SCSI disk 2)
.RE
.fi

.\"O If the file system was changed (i.e., repaired), then
.\"O .B fsck.minix
.\"O will print "FILE SYSTEM HAS CHANGED" and will
.\"O .BR sync (2)
.\"O three times before exiting.  Since Linux does not currently have raw
.\"O devices, there is
.\"O .I no
.\"O need to reboot at this time.
ファイルシステムを変更すると (つまり修復すると)、
.B fsck.minix
は "FILE SYSTEM HAS CHANGED" と表示し、
.BR sync (2)
を 3 回行ってから終了する。
Linux  は今のところ raw デバイスを持たないので、
このときリブートする必要は\fIない\fR。
.\"O .SH WARNING
.SH 警告
.\"O .B fsck.minix
.\"O should
.\"O .B not
.\"O be used on a mounted filesystem.  Using
.\"O .B fsck.minix
.\"O on a mounted filesystem is very dangerous, due to the possibility that
.\"O deleted files are still in use, and can seriously damage a perfectly good
.\"O filesystem!  If you absolutely have to run
.\"O .B fsck.minix
.\"O on a mounted filesystem (i.e., the root filesystem), make sure nothing is
.\"O writing to the disk, and that no files are "zombies" waiting for deletion.
.B fsck.minix
をマウントされているファイルシステムに\fB用いるべきではない\fR。
マウントされているファイルシステムに
.B fsck.minix
を用いるのは非常に危険である。
まだ使用されているファイルを削除してしまう可能性があるので、
まったく問題のないファイルシステムに深刻な障害を与えてしまうかもしれない!
どうしても
.B fsck.minix
をマウントされたファイルシステムに用いなければならない場合
(例えばルートファイルシステムなど) は、
誰もディスクへの書き込みを行っていないこと、
及び削除を待っている「ゾンビ」ファイルが存在しないことを、
よくよく確かめてからにすること。
.\"O .SH OPTIONS
.SH オプション
.TP
.B \-l
.\"O Lists all filenames
全てのファイル名をリストする。
.TP
.B \-r
.\"O Performs interactive repairs
復旧作業を対話的に行う。
.TP
.B \-a
.\"O Performs automatic repairs (this option implies
.\"O .BR \-r ),
.\"O and serves to answer all of the questions asked with the default.  Note
.\"O that this can be extremely dangerous in the case of extensive file system
.\"O damage.
自動的に復旧作業を行い
.RB ( \-r
も指定したことになる)、全ての質問に対してデフォルトの回答をする。
ファイルシステムの被害が大きい場合には、
このオプションを用いるのは非常に危険である。
.TP
.B \-v
.\"O Verbose
饒舌な表示をする。
.TP
.B \-s
.\"O Outputs super-block information
スーパーブロックの情報を出力する。
.\"O .TP
.\"O .B \-m
.\"O Activates MINIX-like "mode not cleared" warnings
MINIX 的な "mode not cleard" の警告を有効にする。
.TP
.B \-f
.\"O Force file system check even if the file system was marked as valid (this
.\"O marking is done by the kernel when the file system is unmounted).
ファイルシステムに有効マークが付いている場合にも強制的にチェックする
(このマークは、ファイルシステムがアンマウントされるときにカーネルが付ける)。
.\"O .SH "SEE ALSO"
.SH 関連項目
.BR fsck (8),
.BR fsck.ext (8),
.BR fsck.ext2 (8),
.BR fsck.xiafs (8),
.BR mkfs (8),
.BR mkfs.minix (8),
.BR mkfs.ext (8),
.BR mkfs.ext2 (8),
.BR mkfs.xiafs (8).
.BR reboot (8)
.\"O .SH DIAGNOSTICS
.SH 診断メッセージ
.\"O There are numerous diagnostic messages.  The ones mentioned here are the
.\"O most commonly seen in normal usage.
多くの診断メッセージが存在する。
ここに紹介するのは、通常の利用でよく見られるだろうものである。

.\"O If the device does not exist,
.\"O .B fsck.minix
.\"O will print "unable to read super block".  If the device exists, but is not
.\"O a MINIX file system,
.\"O .B fsck.minix
.\"O will print "bad magic number in super-block".
デバイスが存在しないと、
.B fsck.minix
は "unable to read super block" と表示する。
デバイスが存在するが MINIX ファイルシステムではない場合は、
.B fsck.minix
は "bad magic number in super-block" と表示する。
.\"O .SH "EXIT CODES"
.SH 終了コード
.\"O The exit code returned by
.\"O .B fsck.minix
.\"O is the sum of the following:
.B fsck.minix
が返す終了コードは、以下の和となる:
.IP 0
.\"O No errors
エラーなし
.IP 3
.\"O File system errors corrected, system should be rebooted if file system was
.\"O mounted
ファイルシステムのエラーが修正された。
ファイルシステムがマウントされていた場合はシステムをリブートすべきである。
.IP 4
.\"O File system errors left uncorrected
ファイルシステムのエラーが修正されずに残っている
.IP 8
.\"O Operational error
動作エラー
.IP 16
.\"O Usage or syntax error
利用法または文法のエラー
.PP
.\"O In point of fact, only 0, 3, 4, 7, 8, and 16 can ever be returned.
実際には 0, 3, 4, 7, 8, 16 以外が返ることはない。
.\"O .SH AUTHOR
.SH 著者
Linus Torvalds (torvalds@cs.helsinki.fi)
.br
.\"O Error code values by Rik Faith (faith@cs.unc.edu)
Rik Faith (faith@cs.unc.edu): エラーコードの値
.br
.\"O Added support for file system valid flag: Dr. Wettstein
.\"O (greg%wind.uucp@plains.nodak.edu)
Dr. Wettstein (greg%wind.uucp@plains.nodak.edu):
ファイルシステム有効フラグのサポート
.br
.\"O Check to prevent fsck of mounted filesystem added by Daniel Quinlan
.\"O (quinlan@yggdrasil.com)
Daniel Quinlan (quinlan@yggdrasil.com):
マウントされているファイルシステムの fsck を避けるためのチェック
.br
.\"O Minix v2 fs support by Andreas Schwab
.\"O (schwab@issan.informatik.uni-dortmund.de), updated by Nicolai
.\"O Langfeldt (janl@math.uio.no)
Andreas Schwab (schwab@issan.informatik.uni-dortmund.de):
Minix v2 ファイルシステムのサポート
.br
Nicolai Langfeldt (janl@math.uio.no): その更新
.br
.\"O Portability patch by Russell King (rmk@ecs.soton.ac.uk).
Russell King (rmk@ecs.soton.ac.uk): 移植性向上のためのパッチ

