linux-jm/manual/manual/util-linux/release/man8/fsck.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.\"
.\" Japanese Version Copyright (c) 1999 NAKANO Takeo all rights reserved.
.\" Translated Mon Mar 18 2000 by NAKANO Takeo <nakano@apm.seikei.ac.jp>
.\" Updated & Modified Wed 14 Jun 2000 by NAKANO Takeo 
.\"
.\" This man page is a part of util-linux.
.\"
.\" " for hilit19
.TH FSCK 8 "2 July 1996" "Util-Linux 2.6" "Linux Programmer's Manual"
.SH 名前
fsck.minix \- Linux 用のファイルシステム整合性チェッカ
.SH 書式
.B "fsck.minix [ \-larvsmf ]"
.I device
.SH 説明
.B fsck.minix
は Linux MINIX ファイルシステムの整合性チェックを行う。
現在のバージョンは、ファイル名のオプションとして 14 文字と
30 文字とをサポートしている。

このプログラムでは、
ファイルシステムがアクティブではないことを前提としている。
マウントされたデバイスに対しては、
誰も書き込みを行っていないという確信が持てなければ、
.B fsck.minix
を用いるべきではない
(そしてカーネルがファイル検索を行うときに、
書き込みを行うかもしれないことに注意)。

.I device
は通常以下のようなものである:

.nf
.RS
/dev/hda[1-63] (IDE disk 1)
/dev/hdb[1-63] (IDE disk 2)
/dev/sda[1-15] (SCSI disk 1)
/dev/sdb[1-15] (SCSI disk 2)
.RE
.fi

ファイルシステムを変更すると (つまり修復すると)、
.B fsck.minix
は "FILE SYSTEM HAS CHANGED" と表示し、
.BR sync (2)
を 3 回行ってから終了する。
Linux  は今のところ raw デバイスを持たないので、
このときリブートする必要は\fIない\fR。
.SH 警告
.B fsck.minix
をマウントされているファイルシステムに\fB用いるべきではない\fR。
マウントされているファイルシステムに
.B fsck.minix
を用いるのは非常に危険である。
まだ使用されているファイルを削除してしまう可能性があるので、
まったく問題のないファイルシステムに深刻な障害を与えてしまうかもしれない!
どうしても
.B fsck.minix
をマウントされたファイルシステムに用いなければならない場合
(例えばルートファイルシステムなど) は、
誰もディスクへの書き込みを行っていないこと、
及び削除を待っている「ゾンビ」ファイルが存在しないことを、
よくよく確かめてからにすること。
.SH オプション
.TP
.B \-l
全てのファイル名をリストする。
.TP
.B \-r
復旧作業を対話的に行う。
.TP
.B \-a
自動的に復旧作業を行い
.RB ( \-r
も指定したことになる)、全ての質問に対してデフォルトの回答をする。
ファイルシステムの被害が大きい場合には、
このオプションを用いるのは非常に危険である。
.TP
.B \-v
饒舌な表示をする。
.TP
.B \-s
スーパーブロックの情報を出力する。
MINIX 的な "mode not cleard" の警告を有効にする。
.TP
.B \-f
ファイルシステムに有効マークが付いている場合にも強制的にチェックする
(このマークは、ファイルシステムがアンマウントされるときにカーネルが付ける)。
.SH 関連項目
.BR fsck (8),
.BR fsck.ext (8),
.BR fsck.ext2 (8),
.BR fsck.xiafs (8),
.BR mkfs (8),
.BR mkfs.minix (8),
.BR mkfs.ext (8),
.BR mkfs.ext2 (8),
.BR mkfs.xiafs (8).
.BR reboot (8)
.SH 診断メッセージ
多くの診断メッセージが存在する。
ここに紹介するのは、通常の利用でよく見られるだろうものである。

デバイスが存在しないと、
.B fsck.minix
は "unable to read super block" と表示する。
デバイスが存在するが MINIX ファイルシステムではない場合は、
.B fsck.minix
は "bad magic number in super-block" と表示する。
.SH 終了コード
.B fsck.minix
が返す終了コードは、以下の和となる:
.IP 0
エラーなし
.IP 3
ファイルシステムのエラーが修正された。
ファイルシステムがマウントされていた場合はシステムをリブートすべきである。
.IP 4
ファイルシステムのエラーが修正されずに残っている
.IP 8
動作エラー
.IP 16
利用法または文法のエラー
.PP
実際には 0, 3, 4, 7, 8, 16 以外が返ることはない。
.SH 著者
Linus Torvalds (torvalds@cs.helsinki.fi)
.br
Rik Faith (faith@cs.unc.edu): エラーコードの値
.br
Dr. Wettstein (greg%wind.uucp@plains.nodak.edu):
ファイルシステム有効フラグのサポート
.br
Daniel Quinlan (quinlan@yggdrasil.com):
マウントされているファイルシステムの fsck を避けるためのチェック
.br
Andreas Schwab (schwab@issan.informatik.uni-dortmund.de):
Minix v2 ファイルシステムのサポート
.br
Nicolai Langfeldt (janl@math.uio.no): その更新
.br
Russell King (rmk@ecs.soton.ac.uk): 移植性向上のためのパッチ

