linux-jm/manual/manual/util-linux/release/man8/mkfs.minix.8
.\" Copyright 1992, 1993, 1994 Rickard E. Faith (faith@cs.unc.edu)
.\" May be freely distributed.
.\"
.\" Japanese Version Copyright (c) 1999 NAKANO Takeo all rights reserved.
.\" Translated Sat Mar 18 2000 by NAKANO Takeo <nakano@apm.seikei.ac.jp>
.\" Updated Fri 18 Feb 2001 by NAKANO Takeo
.\"
.\" This man page is a part of util-linux.
.\"
.\"WORD:	inode		i-ノード
.\"WORD:	bad block	不良ブロック
.\"
.TH MKFS.MINIX 8 "2 July 1996" "Util-linux 2.6" "Linux System Administrator's Manual"
.SH 名前
mkfs.minix \- Linux MINIX ファイルシステムを作成する
.SH 書式
.BR "mkfs.minix [ \-c | \-l filename ] [ \-n"
namelength
.B ] [ \-i
inodecount
.B ] [ \-v ]
device 
.B [ 
size-in-blocks
.B ]
.SH 説明
.B mkfs.minix
は Linux MINIX ファイルシステムをデバイス
(通常はディスクパーティション) 上に作成する。
.PP
.I device
は通常以下のようなものである:
.sp
.nf
.RS
/dev/hda[1-8] (IDE disk 1)
/dev/hdb[1-8] (IDE disk 2)
/dev/sda[1-8] (SCSI disk 1)
/dev/sdb[1-8] (SCSI disk 2)
.RE
.fi
.sp
.I size-in-blocks
引数は、ファイルシステムのサイズの希望値をブロック単位で指定する。
これは、もっぱら過去との互換性の維持を目的とした機能である。
省略されると、サイズは自動的に決定される。
11 以上か、65535 以下の値だけが指定可能である。
.SH オプション
.TP
.B \-c
ファイルシステムを作成する前に、
デバイスに不良ブロックがないかチェックする。
見付かったら、ブロックカウントを表示する。
.TP
.BI \-n " namelength"
ファイル名の最大の長さを指定する。
現在指定できるのは 14 または 30 だけである。
デフォルトは 30。0.99p7 より前のカーネルでは
14 しか受けつけない。
.TP
.BI \-i " inodecount"
ファイルシステムの i-ノードの個数を指定する。
.TP
.BI \-l " filename"
.I filename
から不良ブロックのリストを読み込む
ファイルの一行に不良ブロックをひとつ書く。
読み込んだ不良ブロックのカウントが表示される。
.TP
.B \-v
Minix version 2 ファイルシステムを作成する。
.SH 終了コード
.B mkfs.minix
の返す終了コードは以下のどれかである:
.IP 0
エラーなし
.IP 8
動作エラー
.IP 16
利用法または文法のエラー
.SH 関連項目
.BR mkfs (8),
.BR fsck (8),
.BR reboot (8)

